# Data 200: Database Systems and Data Management for Data Analytics

# Homework 6: Inner and Outer Joins in SQL


---
Enter your name in the markdown cell below.

# Name: Answer Key

# Homework Grade: 100%

# Exercises



**Download the `school.db` database from Teams and save it to the same directory as this notebook.**

**Then, run the code cells below to load the SQL Magic module and connect to the `school.db` database.**

In [4]:
%load_ext sql

In [5]:
%sql sqlite:///school.db

<div class="exercise"><b>Exercise 1:</b></div> 

Write a query to obtain the department chairs for Modern Language (`'LANG'`), Philosophy (`'PHIL'`), and Mathematics and Computer Science (`'MATH'`).  Note that you will need to use an inner join of the `departments` and `instructors` tables.  Project the department name, the chair's last name, and the chair's first name.

Below is the output from my solution:<br>
<code>
departmentname	              instructorlast	instructorfirst
Modern Language	             Brown	         Danielle
Mathematics & Computer Science  Bradley       	Betty
Philosophy	                  Singhal	       Aarav
</code>

In [6]:
%%sql

SELECT departmentname, instructorlast, instructorfirst
FROM departments INNER JOIN instructors 
ON departments.departmentchair = instructors.instructorid
WHERE departments.departmentid IN ('LANG', 'PHIL','MATH')

 * sqlite:///school.db
Done.

[('Modern Language', 'Brown', 'Danielle'),
 ('Mathematics & Computer Science', 'Bradley', 'Betty'),
 ('Philosophy', 'Singhal', 'Aarav')]

<div class="exercise"><b>Exercise 2:</b></div> 

Write a query to list all of the students who are mathematics (`'MATH'`) majors.  Include the student's last and first name, along with the name of the department.  Order the results by last name, first name.  Limit the results to 6 rows.  Note that you will need to use an inner join on the `students` and `subjects` tables.

Below is the output from my solution:<br>
<code>
studentlast	studentfirst	subjectname
Barnett	    Larry	       Mathematics
Campbell	   Gloria	      Mathematics
Chapman	    Robert	      Mathematics
Colombo	    Giulia	      Mathematics
Davis	      Crystal	     Mathematics
Edwards    	Gary	        Mathematics
</code>

In [7]:
%%sql

SELECT studentlast, studentfirst, subjectname
FROM students INNER JOIN subjects 
ON studentmajor = subjectid
WHERE studentmajor = 'MATH'
ORDER BY studentlast, studentfirst
LIMIT 6

 * sqlite:///school.db
Done.

[('Barnett', 'Larry', 'Mathematics'),
 ('Campbell', 'Gloria', 'Mathematics'),
 ('Chapman', 'Robert', 'Mathematics'),
 ('Colombo', 'Giulia', 'Mathematics'),
 ('Davis', 'Crystal', 'Mathematics'),
 ('Edwards', 'Gary', 'Mathematics')]

<div class="exercise"><b>Exercise 3:</b></div> 

Write a query to list all of the students who are taking Math 123-03 in the fall (this corresponds to `classid=40326`). Please use a `USING` clause on `studentid` (to give you practice with it).  Order the results by last name, first name.  Limit the results to 6 rows.  

Below is the output from my solution:<br>
<code>
studentlast	studentfirst
Brewer	     Scott
Castillo	   Stephen
Chapman	    Robert
Coleman	    Billy
Dunn	       Diane
Fox	        Luke
</code>

In [8]:
%%sql

SELECT studentlast, studentfirst
FROM students INNER JOIN student_class
USING (studentid)
WHERE classid = 40326
ORDER BY studentlast,studentfirst
limit 6

 * sqlite:///school.db
Done.

[('Brewer', 'Scott'),
 ('Castillo', 'Stephen'),
 ('Chapman', 'Robert'),
 ('Coleman', 'Billy'),
 ('Dunn', 'Diane'),
 ('Fox', 'Luke')]

<div class="exercise"><b>Exercise 4:</b></div> 

Write a query to find which instructors (last and first names) are teaching in the spring semester.  Your result should not contain any duplicates.  Order the results by last name, first name.  Limit the results to 10 rows. **Hint:** You will need to use a three-table join of the `classes`, `instructor_class`, and `instructors` tables.

Below is the output from my solution:<br>
<code>
instructorlast	instructorfirst
Aguilar	       Stephen
Anderson	      Philip
Arnaud	        Antoine
Austin	        Stephanie
Bailey	        Jayden
Balasubramanium   Hemant
Balasubramanium   Vishal
Banks	         Carolyn
Banks	         David
Barnes   	     Deborah
</code>

In [9]:
%%sql

SELECT DISTINCT instructorlast, instructorfirst
FROM classes INNER JOIN instructor_class USING (classid)
INNER JOIN instructors USING (instructorid)
WHERE classterm ='SPRING'
ORDER BY instructorlast, instructorfirst
LIMIT 10

 * sqlite:///school.db
Done.

[('Aguilar', 'Stephen'),
 ('Anderson', 'Philip'),
 ('Arnaud', 'Antoine'),
 ('Austin', 'Stephanie'),
 ('Bailey', 'Jayden'),
 ('Balasubramanium', 'Hemant'),
 ('Balasubramanium', 'Vishal'),
 ('Banks', 'Carolyn'),
 ('Banks', 'David'),
 ('Barnes', 'Deborah')]

<div class="exercise"><b>Exercise 5:</b></div> 

Write a query to list all courses (subject and number) that were *not* taught in either the fall or spring semesters.  **Hint:** Recall that LEFT JOIN can be used to compute *set differences*.  In particular, you will need to use a left join of the `courses` and `classes` tables.  Furthermore, in order to match up the course subject and number, you may want to use `USING (coursesubject, coursenum)`. Order your results by the course subject and limit your results to six rows.

The output from my solution is:<br>
<code>
coursesubject	coursenum
ARTH	         363
ARTH	         452
BIOL	         363
BIOL	         364
BLST	         265
BLST	         361
</code>

In [10]:
%%sql

SELECT coursesubject, coursenum 
FROM courses 
LEFT JOIN classes USING (coursesubject, coursenum)
WHERE classid IS NULL
ORDER BY coursesubject
LIMIT 6

 * sqlite:///school.db
Done.

[('ARTH', 363),
 ('ARTH', 452),
 ('BIOL', 363),
 ('BIOL', 364),
 ('BLST', 265),
 ('BLST', 361)]

<div class="exercise"><b>Exercise 6:</b></div> 

Write a query to find all English courses (subject, number, and title) that were *not* offered in either the fall or spring semesters.  *This is very similar to the previous exercise*.

The output from my solution is:<br>
<code>
coursesubject	coursenum	coursetitle
ENGL	         340	      Contemporary Drama
ENGL	         349	      Studies in European Lit
</code>

In [11]:
%%sql

SELECT coursesubject, coursenum, coursetitle
FROM courses
LEFT JOIN classes USING (coursesubject, coursenum)
WHERE classid IS NULL AND coursesubject = 'ENGL'

 * sqlite:///school.db
Done.

[('ENGL', 340, 'Contemporary Drama'), ('ENGL', 349, 'Studies in European Lit')]

<div class="exercise"><b>Exercise 7:</b></div> 

Write a query to list instructors (first and last names) and the *number of students* they taught during the year (both fall and spring semesters).  Only include instructors who were actually teaching.  Please name the new column `total_taught` and order your results from smallest to largest.  Limit the results to 10 rows. **Hint:** You will need to join three different tables and use a GROUP BY to accomplish this task.

The output from my solution is:<br>
<code>
instructorfirst	instructorlast	total_taught
Margaux	        Gillet            1
Lisa	           Fuller	        1
Bobby	          Hall	          1
Harrison	       Gray	          1
Aarav	          Jhadav	        2
Kyle	           Stevens	       4
Rose	           James	         5
Philip	         Anderson	      7
Paul	           Dixon	         7
Michelle	       Young	         8
</code>

In [12]:
%%sql

SELECT  instructorfirst, instructorlast, COUNT(studentid) AS total_taught 
FROM instructors 
INNER JOIN instructor_class USING (instructorid)
INNER JOIN student_class USING (classid)
GROUP BY instructorid
ORDER BY count(studentid) ASC
LIMIT 10

 * sqlite:///school.db
Done.

[('Margaux', 'Gillet', 1),
 ('Lisa', 'Fuller', 1),
 ('Bobby', 'Hall', 1),
 ('Harrison', 'Gray', 1),
 ('Aarav', 'Jhadav', 2),
 ('Kyle', 'Stevens', 4),
 ('Rose', 'James', 5),
 ('Philip', 'Anderson', 7),
 ('Paul', 'Dixon', 7),
 ('Michelle', 'Young', 8)]

<div class="exercise"><b>Exercise 8:</b></div> 

Note that in the last exercise we learned that the instructor Kyle Stevens only taught a total of 4 students during the year (which is strange--let's investigate).  Write a query to list the student IDs of these four students, along with the course subject, course number, and course title.  **Hint 1:** In my solution, I joined together five different tables (using four INNER JOIN statements)!  **Hint 2:** You may want to first see if you can list the course subject, course number, and student ID.  Then join the fifth table to get the course title.  That is, sometimes it's easier to build your query in stages to make it more manageable.

The output from my solution is (we can see that Kyle only taught senior research and directed studies):<br>
<code>
coursesubject	coursenum	coursetitle	   studentid
BIOL	         452	      Senior Research   61724
BIOL	         451	      Senior Research   61724
BIOL	         362	      Directed Study    62419
BIOL	         362	      Directed Study    62925
</code>

In [13]:
%%sql

SELECT courses.coursesubject, courses.coursenum, courses.coursetitle, studentid
FROM instructors 
INNER JOIN instructor_class USING (instructorid)
INNER JOIN student_class USING (classid)
INNER JOIN classes USING (classid)
INNER JOIN courses USING (coursesubject, coursenum)
WHERE instructorfirst = 'Kyle' AND instructorlast= 'Stevens'

 * sqlite:///school.db
Done.

[('BIOL', 452, 'Senior Research', 61724),
 ('BIOL', 451, 'Senior Research', 61724),
 ('BIOL', 362, 'Directed Study', 62419),
 ('BIOL', 362, 'Directed Study', 62925)]